fix: doc diagram
